#+TITLE: Plan for Analytics Dashboard
#+AUTHOR: VLEAD
#+DATE: [2017-09-12 Tue]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  - This document explains the realization plan for
    implementing =analytics-dashboard= using =feedback
    analytics= data.

* Plan ([[https://github.com/vlead/analytics-dashboard/milestone/2][Milestone]])
  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone2
  :END: 
  Once this milestone is realized, the following are done to
  the Analytics Dashboard:
  1. The total number of feedbacks can be displayed.
  2. Year wise graphs can be displayed dynamically.
  3. Visualize feedback responses of particular year w.r.t
     labs, experiments and generic feedbacks can be
     dynamically done.
  4. Visualize feedback responses w.r.t Open-edx Lab, Non
     Open-edx Lab, Open-edx Experiment, Non Open-edx
     Experiment and generic feedbacks can be dynamically
     done.
  5. Transition of graphs and arrange them properly in a
     single page can be done.

#+caption:  realization-plan
#+name: tbl-realization-plan
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|    S. | Tasks                     | Github | Expected | Actual |  Estimated |     Actual | Status   | Assignee  |
|    NO |                           | Issues | Effort   | Effort |     Start, |     Start, |          |           |
|       |                           |        | (in      | (in    |        End |        End |          |           |
|       |                           |        | person   | person |      Dates |      Dates |          |           |
|       |                           |        | hours)   | hours) |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|    1. | Display total             | [[https://github.com/vlead/analytics-dashboard/issues/22][#22]]    | 12       | 12     | 27-08-2017 | 27-08-2017 | Done     | Mrudhvika |
|       | number of feedbacks       |        |          |        | 28-08-2017 | 28-08-2017 |          |           |
|       | on the top                |        |          |        |            |            |          |           |
|       |                           |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|    2. | Dynamically display       | [[https://github.com/vlead/analytics-dashboard/issues/23][#23]]    | 32       | 36     | 21-07-2017 | 21-07-2017 | Done     | Mrudhvika |
|       | feedbacks yearly          |        |          |        | 24-07-2017 | 25-07-2017 |          | Reena     |
|       | wise                      |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|    3. | Display feedbacks of      | [[https://github.com/vlead/analytics-dashboard/issues/24][#24]]    | 27       | 32     | 29-08-2017 | 29-08-2017 | Done     | Reena     |
|       | a particular year         |        |          |        | 31-08-2017 | 01-09-2017 |          |           |
|       | on the basis of lab,      |        |          |        |            |            |          |           |
|       | exp and generic           |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|    4. | Present feedbacks in      | [[https://github.com/vlead/analytics-dashboard/issues/25][#25]]    | 40       |        | 06-09-2017 | 06-09-2017 | Done     | Reena     |
|       | further detail            |        |          |        | 13-09-2017 | 15-09-2017 |          |           |
|       | depends on OL, NOL,       |        |          |        |            |            |          |           |
|       | OE, NOE and generic       |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|    5. | Transisions of all        | [[https://github.com/vlead/analytics-dashboard/issues/26][#26]]    |          |        | 18-09-2017 | 18-09-2017 | Done     | Reena     |
|       | the graphs and            |        |          |        | 20-09-2017 | 20-09-2017 |          |           |
|       | arrange them              |        |          |        |            |            |          |           |
|       | properly in a page        |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|    6. | Need to make              | [[https://github.com/vlead/analytics-dashboard/issues/33][#33]]    |          |        | 03-10-2017 | 03-10-2017 | Done     | Reena     |
|       | implementation            |        |          |        | 06-10-2017 | 10-10-2017 |          |           |
|       | responsive                |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|    7. | Need to make              | [[https://github.com/vlead/analytics-dashboard/issues/34][#34]]    |          |        | 11-10-2017 | 11-10-2017 | Done     | Reena     |
|       | implementation            |        |          |        | 13-10-2017 | 13-10-2017 |          |           |
|       | in literate mode          |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|    8. | Create complete           | [[https://github.com/vlead/analytics-dashboard/issues/37][#37]]    |          |        | 26-10-2017 | 26-10-2017 | Done     | Reena     |
|       | script folder             |        |          |        | 30-10-2017 | 31-10-2017 |          |           |
|       |                           |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|    9. | Need to remove            | [[https://github.com/vlead/analytics-dashboard/issues/36][#36]]    |          |        | 01-11-2017 | 01-11-2017 | Done     | Reena     |
|       | empty box bug             |        |          |        | 03-11-2017 | 03-11-2017 |          |           |
|       |                           |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|   10. | Need to create sample     | 38     |          |        | 06-11-2017 | 06-11-2017 | Done     | Reena     |
|       | designs of layout for     |        |          |        | 13-11-2017 | 15-11-2017 |          |           |
|       | viewing dashboard         |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|   11. | Need to make              |        |          |        | 16-11-2017 | 16-11-2017 | In       | Reena     |
|       | implementation            | 41     |          |        | 22-11-2017 | 23-11-2017 | Progress |           |
|       | dynamic                   |        |          |        |            |            |          |           |
|       |                           |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|   12. | Run ADS using             | 28     |          |        | 30-11-2017 | 30-11-2017 | Done     | Reena     |
|       | Vagrant box               |        |          |        | 10-12-2017 | 15-12-2017 |          |           |
|       |                           |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|   13. | Install mysql and dump    |        |          |        | 26-12-2017 | 26-12-2017 | Done     | Reena     |
|       | feedback in database      |        |          |        | 29-12-2017 | 29-12-2017 |          |           |
|       |                           |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|   14. | Run analytics-db database |        |          |        | 02-01-2018 | 02-01-2018 | Done     | Reena     |
|       | service behind nginx      |        |          |        | 05-01-2018 | 05-01-2018 |          |           |
|       |                           |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|   15. | Create container/vm       |        |          |        | 08-01-2018 | 08-01-2018 | Done     | Reena     |
|       | running feedback service  |        |          |        | 12-01-2018 | 12-01-2018 |          |           |
|       |                           |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|   16. | Create container/vm       |        |          |        | 15-01-2018 | 15-01-2018 | Done     | Reena     |
|       | running elasticsearch     |        |          |        | 22-01-2018 | 23-01-2018 |          |           |
|       | service                   |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|   17. | Use new feedback          | 43     |          |        | 29-01-2018 |            |          | Reena     |
|       | analytics url and make    |        |          |        |            |            |          |           |
|       | changes accordingly       |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|   18. | change code which uses    | 43     |          |        |            |            |          | Reena     |
|       | feedback data in          |        |          |        | 13-02-2018 |            |          |           |
|       | json file instead         |        |          |        |            |            |          |           |
|       | of using url              |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
|   19. | Deploy manually           |        |          |        |            |            |          |           |
|       | on local machine          |        |          |        |            |            |          |           |
|       |                           |        |          |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
| Total |                           |        | 121      |        |            |            |          |           |
|     ^ |                           |        | total    |        |            |            |          |           |
|-------+---------------------------+--------+----------+--------+------------+------------+----------+-----------|
#+TBLFM: $total=vsum(@II+1..@-1)
